Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་ཕྱུག་ལ་ཉམ་ཐག་ཐག་སྐད་དུ་བྱས་ན།
en: He should then call out to Noble Avalokiteśvara, and a lotus pond will appear at the place that was struck.

source: དེ་ནས་གནས་གང་དུ་བརྡབས་པའི་གནས་དེར་ལྷ་རྫས་ཀྱི་ཆུ་ཧ་ཅང་གྲང་པ་ཡང་མིན། ཧ་ཅང་དྲོ་བ་ཡང་མིན། རོ་དང་ཆས་པ་ཡོད་པའི་རྫིང་བུ་འབྱུང་བར་འགྱུར་རོ།
en: It will contain divine water that is neither too cold nor too hot and that tastes sweet.

source: །དེ་ནས་རིག་སྔགས་འཆང་བས་དབྱུག་པ་ལ་ཁྲོ་བོའི་རྒྱལ་པོ་ལན་བདུན་བཟླས་བརྗོད་བྱ་སྟེ། རྫིང་བུའི་ནང་དུ་ཆུ་ལ་བརྡབ་པར་བྱའོ། །དེ་ནས་རྫིང་བུའི་ནང་ནས་མི་སེར་སྐྱ་བོ་ཞིག་བྱུང་སྟེ།
en: The vidyā holder should incant the rod with the Krodharāja mantra seven times and strike the water in the middle of the pond.

source: རིག་སྔགས་འཆང་བ་ལ་ཐལ་མོ་ཁོང་སྟོང་དུ་སྦྱར་ནས་མདུན་ན་འདུག་སྟེ་རིག་སྔགས་འཆང་བ་ཅི་འདོད་ཅེས་སྨྲས་བར་འགྱུར་རོ།
en: A brown man will instantly emerge, stand before the vidyā holder with folded hands, and say, ‘Tell me, vidyā holder, what do you need?’

source: །རིག་སྔགས་འཆང་བས་བདག་ནི་ཁ་ཟས་ཀྱི་ཁ་ཟས་ཀྱི་ཆེད་དུ་ལགས་ཀྱིས་སྩལ་དུ་གསོལ་ཞེས་བརྗོད་པར་བྱའོ།
en: The vidyā holder should reply, ‘I need food. Please give it to me!’

source: །དེ་ནས་རིག་སྔགས་འཆག་བས་མི་དེ་ལ་ཤིས་པའི་ཚིག་བརྗོད་པར་བྱའོ། །དེ་ནས་མི་དེ་རྫིང་བུའི་ནང་དུ་ཞུགས་པ་དང་།
en: and bid farewell to the man, who will subsequently reenter the water of the pond. “

source: སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་ལ་ཁ་ཟས་དང་བཏུང་བའི་རོ་ཞིམ་པོ་རྣམ་པ་སྣ་ཚོགས་ཡོད་པར་བྱེད་ཅིང་རིག་སྔགས་འཆང་བ་ལ་སྦྱིན་པར་བྱེད་དོ། །སྐྱེ་བོ་སྟོང་ཕྲག་བརྒྱའི་སྟོན་མོ་བྱར་ཡོད་ཅིང་ཡོ་བྱད་ཕུན་སུམ་ཚོགས་པ་ཤིན་ཏུ་མང་པོར་འགྱུར་རོ།
en: After a short while, the man will bring various kinds of dainty food and drink and offer them to the vidyā holder in quantities sufficient for one hundred thousand people. He will also give him an assortment of other useful things.

source: །གལ་ཏེ་རིག་སྔགས་འཆང་བས་རྫིང་བུ་མེད་པར་མི་བྱེད་ན་རྫིང་བུ་དེ་དུས་རྟག་ཏུ་གནས་པར་འགྱུར། མི་སྣང་བར་མི་འགྱུར་ཏེ། སེམས་ཅན་ཐམས་ཅད་དང་འགྲོན་པོ་ཐམས་ཅད་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བྲེལ་བ་མེད་པར་འབྱུང་བར་འགྱུར་རོ།
en: If the vidyā holder does not make the pond disappear again, it will remain forever without disappearing, and all kinds of useful things in impeccable condition will appear in it for all travelers and all beings. “

source: །འོན་ཏེ་དོན་ཡོད་པ་སྣ་ཚོགས་བྱ་བར་འདོད་ན་རིག་སྔགས་འཆང་བ་དེས་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བྱས་པའི་དྲི་ཆུས་ཁྲུས་བྱས་ལ་སྤྱི་གཙུག་བཅིང་བར་བྱའོ།
en: If the vidyā holder wants to accomplish the practice of the amogha circle, he should bathe in perfumed water incanted twenty-one times and tie his hair in a topknot without saying anything.

source: །མི་སྨྲ་བར་དབྱུག་པ་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱས་ཏེ་བསྐོར་བར་བྱའོ།
en: He should incant the amogha rod one hundred and eight times and swing it in the midst of an assembly.

source: །དེ་ནས་འཁོར་དང་སྐྱེ་བོ་མང་པོ་འཁོར་ཞིང་རྨོངས་པར་འགྱུར་རོ།
en: The most prominent members of the assembly will subsequently become confused and befuddled.

source: །དེ་ནས་དབྱུགས་པ་བསྐོར་བ་བྱས་ན་ཡིད་ལ་ཇི་ལྟར་སེམས་པའི་ངོ་བོ་དེ་བཞིན་དུ་ཐམས་ཅད་སྟོན་པར་བྱེད་དོ། །འབྲས་བུ་དང་མེ་ཏོག་གི་ཆར་འབེབས་སོ། །སྒྱུ་མ་རྣམ་པ་སྣ་ཚོགས་སྟོན་པར་བྱེད་དོ།
en: If the vidyā holder swings the rod again, he will be able to manifest any form exactly as he imagines it and able to produce showers of fruits and flowers and various magical displays. “

source: །དེ་ནས་རོ་ལངས་བསླང་བར་འདོད་ན་རིག་སྔགས་འཆང་བ་དེས་ལེགས་པར་ཁྲུས་བྱས་ཤིང་གོས་གསར་བ་བགོས་ཏེ། གཙང་མར་བྱས་ལ་དུར་ཁྲོད་དུ་སོང་སྟེ།
en: If the vidyā holder wants to cause a vetāla to possess a dead body, he should purify himself ritually, bathe thoroughly, put on clean clothes, and go to a charnel ground.

source: དབྱུག་པ་ལ་དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་ལན་བདུན་བཟླས་བརྗོད་བྱས་ནས་ཁྲོ་བོའི་རྒྱལ་པོ་ལན་བདུན་བཟླས་བརྗོད་བྱེད་ཅིང་དུར་ཁྲོད་ཀྱི་ནང་དུ་བསྐོར་བ་བྱས་ན་དཔག་ཚད་ཚུན་ཆད་དུ་ཀུན་ཏུ་མཚམས་བཅད་པར་འགྱུར་རོ།
en: There, he should incant the amogha rod seven times with the heart mantra of Amogharāja and seven times with the mantra of Krodharāja.

source: །བགེགས་ཐམས་ཅད་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་མ་རུངས་པ་ཐམས་ཅད་བཅིངས་པར་འགྱུར་རོ།
en: By swinging the rod in the middle of the charnel ground, he will create a protected area extending one league in all directions, and he will bind all the vighnas and wicked yakṣas and rākṣasas there.

source: །དེ་ནས་རིག་སྔགས་འཆང་བས་མི་རོ་བླངས་ཏེ་བཀྲུ་བར་བྱའོ།
en: He should then take the dead body, wash it, and clean it with the five products of the cow. “

source: །བའི་རྣམ་ལྔས་སྦྱང་བར་བྱའོ། །བའི་ལྕི་བས་དཀྱིལ་འཁོར་གྲུ་བཞི་ལྷམ་པར་བྱའོ། །སེང་ལྡེང་གི་ཕུར་པ་ཚད་སོར་བཅུ་གཉིས་པ་བཞི་གྲྭ་བཞིར་གཟུགས་པར་བྱའོ།
en: He should use cow dung to mark out a symmetrical maṇḍala with four corners, and then drive four pegs made of cutch wood, twelve fingers long, into each corner.

source: །ཚོན་སྣ་ལྔའི་སྐུད་པས་དཀྱིལ་འཁོར་ཀུན་ཏུ་བསྐོར་བར་བྱའོ།
en: He should surround the maṇḍala with five-colored thread stretched around the pegs.

source: །མི་རོ་རས་དཀར་པོས་དཀྲི་བར་བྱས་ལ་དཀྱིལ་འཁོར་དབུས་སུ་གཞག་པར་བྱའོ། །མེ་ཏོག་གིས་གཏོར་བར་བྱའོ། །གཏོར་མ་དཀར་པོ་གཞག་པར་བྱའོ།
en: He should wrap the dead body in a white shroud, place it in the center of the maṇḍala, and strew the maṇḍala with flowers.

source: །མཆོད་ཡོན་གྱི་ཆུ་གཞག་པར་བྱའོ། །གུ་གུལ་གྱི་བདུག་པ་སྦྱིན་པར་བྱའོ།
en: He should offer a bali of three ‘white’ foods, offer argha water for the feet, and burn incense of bdellium.

source: །རིག་སྔགས་འཆང་བ་ཤར་ཕྱོགས་སུ་ཁ་བལྟས་ཏེ་འདུག་ལ། དབྱུག་པ་ལག་པ་གཡས་པར་བཞག་སྟེ། རིག་པའི་རྒྱལ་པོ་གདོན་པར་བྱའོ། །ཁྲོ་བོའི་རྒྱལ་པོ་ལན་དྲུག་ཅུ་དྲན་པར་བྱའོ། །གཡས་པས་བྱབ་པར་བྱའོ།
en: He should then sit down facing the east, hold the amogha rod in his right hand, repeat the king of vidyās, and mindfully repeat the mantra of Krodharāja sixty times.

source: །ལག་པ་གཡས་པའི་དབྱུག་པས་བརྡབ་པ་བྱས་ན་མི་རོ་དེ་འགུལ་བར་འགྱུར།
en: He should stroke the right side of the corpse and hit its right arm with the rod.

source: གཡོ་བར་འགྱུར། ལངས་ཏེ་ཕྱོགས་བཅུར་ལྟ་བར་འགྱུར།
en: The corpse will move and tremble, get up, and look in the ten directions.

source: རིག་སྔགས་འཆང་བས་དབྱུག་པ་དེ་སྤྱི་བོར་གཞག་པར་བྱས་ན། མི་རོ་དེ་ཚིག་སྨྲ་བར་འགྱུར་རོ།
en: When the vidyā holder places the rod on the vetāla’s head, it will start speaking. “

source: །རིག་སྔགས་འཆང་བས་གསང་སྔགས་དྲན་པར་བྱའོ། །ཡིད་ཀྱིས་བསམ་པར་བྱས་ན་མི་རོ་དེ་ཐམས་ཅད་སྨྲ་བར་འགྱུར་ཏེ།
en: The vidyā holder should mindfully repeat the mantra and think of the things he wants to know.

source: འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བ་དང་། མ་འོངས་པ་ན་འབྱུང་བ་སྨྲ་བར་འགྱུར་རོ།
en: The vetāla will tell him everything—things that happened in the past, that will happen in the future, or that are happening now.

source: །དེ་ནས་རིག་སྔགས་འཆང་བས་དབྱུག་པ་སྙིང་གར་གཞག་པར་བྱས་ན་ཁྲག་ཏུ་སྐྱུག་པར་འགྱུར།
en: When the vidyā holder places the rod on the corpse’s heart, blood will spurt out, and the vidyā holder should use it to mark a bindi on his forehead.

source: ཁྲག་དེས་ཐིག་ལེ་བྱས་ན་ཁྱིམ་ཐམས་ཅད་ལ་སྒོ་སྲུང་མེད་ཅིང་།
en: This will allow him to pass through any door unobstructed.

source: སྒོ་ཐམས་ཅད་གདངས་པར་འགྱུར་རོ། །བུད་མེད་དང་། སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོ་ཐམས་ཅད་དབང་དུ་གྱུར་ཅིང་འདུག་གོ།
en: The doors to all the palaces will thus be open for him, and all the women, men, boys, and girls dwelling there will fall under his thrall. “

source: །དབྱུག་པ་སྙིང་གར་བཙིར་ན་སྐྱུག་པར་འགྱུར་རོ།
en: If the vidyā holder presses harder with the rod, the corpse will vomit its heart.

source: །རིག་སྔགས་འཆང་བས་བླངས་ཏེ་མཐའ་དག་བཟའ་བར་བྱའོ།
en: The vidyā holder should take it and eat it whole.

source: །ཟོས་པ་ཙམ་གྱིས་ནམ་མཁའ་ལ་འགྲོ་བར་འགྱུར་རོ། །འབྱུང་པོ་ཆེན་པོའི་བདག་པོ་དང་། དབང་ཕྱུག་ཆེན་པོ་འདྲ་བར་འགྱུར་རོ། །ལྷའི་ལོ་སྟོང་དུ་འཚོ་བར་འགྱུར་རོ།
en: As soon as he does, he will ascend into the sky, become a great lord of bhūtas like Maheśvara, and live thousands of celestial years.

source: །ཨོཾ་ཞེས་བྱ་བས་དབྱུག་པས་བཅིར་ལ་བསྡིགས་པ་བྱས་ན་དེ་ནས་ལྕེ་འབྱིན་པར་འགྱུར་རོ།
en: Alternatively, if he presses the rod while pronouncing the syllable oṁ and threatening the corpse, its tongue will stick out.

source: །རིག་སྔགས་འཆང་བས་བཅད་ལ་རིག་སྔགས་འཆང་བས་བླང་བར་བྱའོ།
en: The vidyā holder should chop it off and hold it.

source: །བླངས་པ་ཙམ་གྱིས་ནམ་མཁའ་ལ་འགྲོ་བར་འགྱུར་རོ། །རིག་སྔགས་འཆང་བ་རལ་གྲིའི་འཁོར་ལོས་སྒྱུར་ཡར་འགྱུར་རོ། །ལོ་སྟོང་ཕྲག་བཅུར་འཚོ་བར་འགྱུར་རོ།
en: As soon as does, he will ascend into the sky, become an emperor of all sword vidyādharas, and live ten thousand years.

source: །རིག་སྔགས་འཆང་བ་བཅྭ་བརྒྱད་ཀྱི་འཁོར་གྱིས་བསྐོར་བར་འགྱུར་རོ།
en: His retinue of vidyādharas will number eighteen. “

source: །དེ་ནས་རིག་སྔགས་འཆང་བས་མི་རོའི་སྤྱི་བོར་དབྱུག་པས་བརྡ་བས་ན་སྒྲ་འབྱུང་བར་འགྱུར་ཞིང་ཤི་བའི་རོ་གཅིག་ཏུ་མཁྲེགས་པའི་གསེར་ཡིན་པས་བླང་བ་བྱས་ན་སྲང་གཅིག་གིས་ཟངས་སྲང་སྟོང་གསེར་དུ་འགྱུར་རོ།
en: By striking the corpse on the head with the rod, the vidyā holder will release the vetāla. The dead body will then become a single piece of solid gold, which the vidyā holder should take. He will be able to use that one pala to turn one thousand palas of copper into gold.

source: །དེ་དག་ནི་འཇིག་རྟེན་པ་སྒྲུབ་པའི་ཆོ་ག་ཡིན་ནོ།། །།
en: This procedure is for accomplishing worldly purposes.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་དག་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་བདག་གི་འཇིག་རྟེན་པའི་ཆོ་ག་ལགས་སོ།
en: The noble bodhisattva Avalokiteśvara further said to the Blessed One, “My instructions for accomplishing worldly purposes are, O lord, an expression of my compassionate concern for all beings.”

source: །དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་བཀའ་སྩལ་པ། སེམས་ཅན་ཆེན་པོ་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་བརྩེ་བའི་ཕྱིར། འཇིག་རྟེན་ལས་འདས་པའི་ཆོ་ག་དམ་པ་གསང་བའི་སྙིང་པོ་དང་། དཀྱིལ་འཁོར་དང་བློ་བརྟན་པོ་འཇིགས་པ་མེད་པ་ཐོབ་པར་འགྱུར་བ་དང་། རིག་སྔགས་འཆང་ཐམས་ཅད་ཀྱི་དམ་པ་སྒྲུབ་པར་བྱེད་པ་དེ་ཁོ་ན་ཉིད་གྲུབ་པར་འགྱུར་བ་དང་།
en: The Tathāgata Śākyamuni replied, “O great being, out of compassion for all beings, please now teach the most secret heart maṇḍala through which beings can attain mental stability and fearlessness and by which all vidyā holders reach the supreme accomplishment in their practice.

source: བཀླགས་པ་དང་། དྲན་པ་ཙམ་དང་། སྒྲུབ་པར་བྱེད་པ་ཙམ་གྱིས་དེ་དག་ཐམས་ཅད་གྲུབ་པ་ཆེན་པོ་ཐོབ་པར་འགྱུར་བ་དང་།
en: This maṇḍala, when memorized through study and successfully performed, brings this accomplishment in full.

source: བསམ་པ་ཆེན་པོ་ཡོངས་སུ་རྫོགས་བར་གྲུབ་པར་འགྱུར་བ་དང་།
en: It is a great fulfiller of wishes.

source: མཆོག་གྲུབ་པ་ཆེན་པོ་སོ་སོར་ཐོབ་པར་འགྱུར་བ་དང་།
en: The vidyā holder will thus obtain all the best and greatest accomplishments.

source: རིག་སྔགས་འཆང་བའི་འདོད་པར་གཏོགས་པ་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་གྲུབ་པར་འགྱུར་བ་སྨོས་ཤིག །
en: All his desires will be fulfilled, and all his hopes will come true.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་ནས་དབུགས་འབྱིན་པ་དང་། བསྒོ་བ་ཐོས་ནས་ཤིན་ཏུ་ཡིད་དགའ་བ་ཆེན་པོར་གྱུར་ཏེ།
en: Noble Avalokiteśvara, the great bodhisattva being, encouraged by the Blessed One, was overjoyed when he heard this request for instructions.

source: དེ་སྟན་ལས་ལངས་ནས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། མེ་ཏོག་དང་། བདུག་པ་དང་། དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ཆོས་གོས་དང་།
en: He got up from his seat, put his robe over one shoulder, and, placing his right knee on the ground, bowed toward the Blessed One with folded hands and touched the Blessed One’s feet with his head.

source: གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། གོས་དང་། རྒྱན་སྣ་ཚོགས་དང་།
en: He made large offerings to him that included a variety of flowers, incense, fragrances, garlands, scented oils, scented powders, monk’s robes, parasols, banners, flags, and various garments, adornments, and ornaments.

source: སྤུད་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་དང་བསྙེན་བཀུར་ཆེན་པོ་བྱས་ཏེ་མཆོད་ནས་འཁོར་གྱི་དཀྱིལ་འཁོར་མང་པོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་དཀྱིལ་འཁོར་གྱི་ལྟར་གཏོགས་པ་དང་། གང་དག་རིག་འཛིན་གྲུབ་པ་དང་། གང་དག་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་།
en: Having thus worshiped the Blessed One with offerings, Noble Avalokiteśvara made offerings to the great assembly—to the great bodhisattva beings, to the gods present in the gathering, to the siddhas and vidyādharas, to the devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas who were established in the samaya of the great maṇḍala of liberation of Amoghapāśa, and to the beings who dwell on Potala Mountain.

source: དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། གང་དག་དོན་ཡོད་པའི་ཞགས་པའི་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་གྱི་དམ་ཚིག་ལ་རྗེས་སུ་ཞུགས་པ་དང་། གང་དག་རི་བོ་པོ་ཊ་ལ་ལ་གནས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་མེ་ཏོག་དང་། བདུག་པ་དང་། དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། གོས་དང་། རྒྱན་སྣ་ཚོགས་དང་།
en: He gave them all various flowers, incense, fragrances, garlands, and scented oils of superior quality, as well as various garments, adornments, ornaments, and jewelry.

source: ཆས་དང་། སྤུད་པ་སྣ་ཚོགས་ཀྱིས་མཆོད་པ་བྱས་ཏེ་ཡིད་དགའ་བར་གྱུར་ཏོ། །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་བཅོམ་ལྡན་འདས་ལ་སྟོང་ཕྲག་བརྒྱ་བསྐོར་བ་བྱས་འཁོར་གྱི་དཀྱིལ་འཁོར་དེ་ལ་ཡང་མཆོད་པ་བྱས་ནས།
en: Having thus honored them with offerings, the exhilarated Noble Avalokiteśvara circumambulated the Blessed One clockwise hundreds of thousands of times, paid respect to the circle of the assembly, and bowed with folded hands toward the Blessed One.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ཏེ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་མིག་མི་འཛུམས་པར་འདུག་སྟེ། བཅོམ་ལྡན་འདས་ལ་ཚིག་འཇམ་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ལ་མཆིས་པ་ནི་རྨད་དུ་བྱུང་བ་རྣམ་པར་ལྟ་བ་དོན་ཡོད་པའི་ཆོ་འཕྲུལ།
en: Facing him, he spoke to the Blessed One without blinking and in the sweetest of voices: “I have, O Blessed One, a maṇḍala of liberation that is wonderful to behold.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རྨད་དུ་བྱུང་བ་དེ་ཁོ་ན་ཉིད་རྣམ་པར་འཕྲུལ་པ་རྣམ་པར་སྣང་མཛད་ཀྱི་བྱིན་གྱིས་བརླབས་དང་། དམ་ཚིག་ཆེན་པོའི་དཀྱིལ་འཁོར་དོན་ཡོད་པའི་རྣམ་པར་ལྟ་བའི་ཞགས་པའི་སྙིང་པོ་དང་།
en: It is a miraculous amogha manifestation, the heart essence of all the tathāgatas, a magical display of the wondrous reality of all the tathāgatas, a maṇḍala of the great samaya that is blessed by Vairocana.

source: འཇིག་རྟེན་ལས་འདས་པའི་བཀླག་པ་དང་། སྒྲུབ་པར་བྱེད་པ་གྲུབ་པ་མཆོག་ཏུ་གྱུར་པའི་སྙིང་པོ་དང་།
en: It is the heart of Amoghavilokita­pāśa and the very essence of the accomplishment of the study and practice of the supramundane.

source: འཇིག་རྟེན་ལས་འདས་པའི་མཆོག་སྒྲུབ་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་ཤིང་ལུང་བསྟན་པ་ལགས་ཏེ།
en: It leads to the ultimate supramundane accomplishment. Taught by all the tathāgatas, it possesses their blessing. “

source: དེ་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་བཅོམ་ལྡན་འདས་ཀྱི་བྱིན་གྱིས་བརླབས་ཀྱིས་རིག་སྔགས་འཆང་ཐམས་ཅད་མཆོག་ཏུ་གྲུབ་པར་བྱ་བའི་ཕྱིར་དང་།
en: Lord, with your blessing I will now present this maṇḍala of liberation in your presence for the sake of the ultimate accomplishment of all vidyā holders.

source: སེམས་ཅན་ཐམས་ཅད་བསྒྲལ་བའི་ཕྱིར་དམྱལ་བ་དང་། ཡི་དགས་ཀྱི་གནས་དང་།
en: I will present it to save all beings and to prevent rebirth in any of the hells, the realm of animals, or the world of Yama.

source: གཤིན་རྗེའི་འཇིག་རྟེན་སེལ་བ་སྔོན་གྱི་སྒྲིབ་པ་དང་། སྡིག་པ་མི་ཟད་པ་འཇོམས་པ་ངན་སོང་ཐམས་ཅད་སེལ་བ། འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་སྡིག་པ་དང་སྒྲིབ་པ་ངེས་པར་སྲེག་པར་བྱེད་པ། ཡོངས་སུ་བསྒྲགས་པར་བགྱིའོ། །མཚམས་མེད་པ་ལྔ་དང་། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་སྤོང་བ་དང་། དམ་པའི་ཆོས་སྤོང་བ་དང་། མཚམས་མེད་པ་ལ་གཞོལ་བ་དང་། འཕགས་པའི་དགེ་འདུན་ལ་འཁུ་བ་དང་།
en: I present it to remove all previously accumulated obscurations, nonvirtue, and wrongdoings, to block all unhappy destinies, and to incinerate all worldly and supramundane negativities and obscurations.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཐམས་ཅད་སྤོང་བར་བྱེད་པ་དེ་དག་གིས་མཉན་པ་དང་། མཐོང་བ་ཙམ་དང་། སྡོམ་པ་ཙམ་དང་།
en: By merely listening to, seeing, training in, dwelling in, teaching, or elucidating this maṇḍala of liberation, beings will completely exhaust all the consequences of the five acts of immediate retribution and of denying the realization of the Buddha, opposing realized beings, offending the noble saṅgha, or opposing any śrāvakas, pratyekabuddhas, or bodhisattvas—acts that would otherwise lead to rebirth in the Avīci hell.

source: ལན་ཅིག་འབད་པ་དང་། འཆད་པ་ཙམ་གྱིས་ཐམས་ཅད་བྱང་བར་འགྱུར་རོ། །ང་མཐོང་བ་ཙམ་གྱིས་ཐམས་ཅད་ཟད་པར་འགྱུར།
en: By merely seeing me, beings will exhaust and cast off all their negativity.

source: བྱང་བར་འགྱུར་རོ། །རིམས་ཐམས་ཅད་དང་། ནད་ཐམས་ཅད་དང་།
en: They will then be free from all fever and disease.

source: དྲི་མ་དང་། སེར་སྣ་དང་ཕྲག་དོག་ཐམས་ཅད་དང་བྲལ་བར་འགྱུར་རོ། །ཉོན་མོངས་པ་དང་། སྒྲིབ་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རོ། །འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་སྡུག་བསྔལ་སྐྱེ་བ་དང་།
en: All their stains of envy and jealousy will be cleansed, they will be free from all afflictions and obscurations, and all their suffering, mundane and transcendent, will depart.

source: རྒ་བ་དང་། འཆི་བ་དང་། ནད་དང་མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་ཐམས་ཅད་དང་བྲལ་བར་འགྱུར་རོ། །འཐབ་པ་དང་། རྩོད་པ་དང་། འགྱེད་པ་དང་། ཕུང་བར་བྱེད་པ་དང་། བརྡེག་པ་དང་། བསྡིགས་པ་དང་། གསོད་པ་དང་། གཡུལ་འགྱེད་པ་དང་། ཤགས་འགྱེད་པ་དང་། བཙོན་དུ་འཛིན་པ་དང་། ལྕགས་སུ་འཇུག་པ་དང་།
en: They will leave behind birth, old age, disease, death, grief, lamentation, pain, and despair.

source: རྐུན་མ་དང་། ཟོལ་བ་དང་། མི་རྒོད་དང་། སེང་གེ་དང་། གླང་པོ་ཆེ་དང་། མ་ཧེ་དང་།
en: All quarrels, scuffles, riots, beatings, threats, blockades, disputes, chains and fetters, discords, imprisonments, and the dangers from thieves, robbers, bandits, lions, elephants, and buffalo will cease.

source: ནད་ངན་པ་དང་། དམུ་ཆུ་དང་། ཤ་བཀྲ་དང་། མཛེ་དང་། འབྲུམ་བུ་དང་། གཡོན་ཅན་དང་། ཤུ་བ་དང་། ཤུ་བྲན་དང་། གཡན་པ་དང་། ཀླད་པན་པ་དང་། གཞོགས་ཕྱེད་ན་བ་དང་། དོམ་དང་། དྲེད་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། བརྗེད་བྱེད་དང་།
en: All disease, decrepitude, edema, spotted leprosy, scabs, skin eruptions, dadrū leprosy, itching, headaches, and hemiplegia will be cured.

source: སྦྲུལ་མ་རུངས་པ་དང་། ཁ་གདུག་པ་དང་། སྦྲུལ་ནག་པོ་དང་། སྲོག་ཆགས་གོ་ན་དང་། དུག་དང་བཅས་པའི་སྲོག་ཆགས་འཇིགས་པ་སྣ་ཚོགས་དང་བཅས་པ་དང་། མེ་དང་། ཆུ་དང་། དུག་དང་། མཚོན་དང་། གཡང་ས་དང་།
en: There will be no danger from bears, wolves, yakṣas, rākṣasas, pretas, piśācas, apasmāras, king’s poisoners, āśīviṣa snakes, cobras, gonāsa snakes, and any other venomous creatures.

source: ཁྱིམ་རྡིབ་པ་དང་། གྲང་བ་དང་། རླུང་དང་། ཉི་ཚན་དང་། བྱི་བ་ཁ་གདུག་པའི་འཇིགས་པ་ཐམས་ཅད་ནི།
en: There will be no danger from fire, water, poison, weapons, falling, slipping in a house, cold, wind, heat, hail, and rats. “

source: བཀླགས་པ་དང་། ཁ་ཏོན་བྱས་པ་དང་། མཐོང་བ་ཙམ་གྱིས་ཐམས་ཅད་རྣམ་པར་ཞིག་པར་འགྱུར།
en: All these calamities will disappear by merely reading, memorizing, or teaching this maṇḍala of liberation.

source: ཕུང་བར་འགྱུར། མོད་ལ་ཕྱེ་མར་བརླག་པར་འགྱུར་རོ།
en: They will disperse and cease.

source: །ཡོངས་སུ་ཐར་བར་འགྱུར་བ་འདི་ལ་དོགས་པར་མི་བྱ།
en: Beings will be freed from them instantaneously.

source: ཡིད་གཉིས་བསྐྱེད་པར་མི་བྱ། ཐེ་ཚོམ་མི་བྱ། སེམས་ཅན་གཉིས་སུ་འགྱུར་བ་བསྐྱེད་པར་མི་བྱའོ།
en: This should not be questioned, denied, or disbelieved, nor should any doubt arise in the mind.

source: །བཅོམ་ལྡན་འདས་བདག་རྟག་ཏུ་མངོན་དུ་དྲན་པར་བགྱི་བ་དང་། རྟག་ཏུ་ཡིད་ལ་བྱེད་པའི་བློ་འབྱུང་བར་བགྱིའོ།
en: Instead, O Blessed One, the vidyā holder should continually visualize me in front of him, continually think of me, and be aware of my presence.

source: །དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་དང་།
en: He should repeat the heart mantra of Amoghapāśa and the heart mantra of Krodharāja.

source: ཁྲོ་བོའི་རྒྱལ་པོའི་སྙིང་པོ་ཡང་དང་བཟླས་པར་བགྱིའོ།
en: He should also, at all times, keep this maṇḍala of liberation in mind.

source: །རྨད་དུ་བྱུང་བ་རྣམ་པར་ལྟ་བ། དོན་ཡོད་པ་རྣམ་པར་འཕྲུལ་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་རྨད་དུ་བྱུང་བའི་ཆོ་འཕྲུལ་རྣམ་པར་སྣང་མཛད་ཀྱི་བྱིན་གྱིས་བརླབས། དམ་ཚིག་ཆེན་པོའི་དཀྱིལ་འཁོར་དོན་ཡོད་པར་རྣམ་པར་ལྟ་བའི་ཞགས་པའི་སྙིང་པོ་ནི་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་དུས་ཐམས་ཅད་དུ་ཡིད་ལ་ཁ་ཏོན་དུ་བརྗོད་པར་བྱའོ།
en: It is wonderful to behold, a miraculous amogha manifestation, the heart essence and magical display of all the tathāgatas, the maṇḍala of the great samaya blessed by Vairocana, and the heart essence of Amoghavilokita­pāśa.

source: །རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་རྗེས་སུ་དྲན་པར་བསྒོམ་པར་བྱའོ།
en: He should always repeat it mentally and verbally with uninterrupted mindfulness. “

source: །དེ་དག་དྲན་པ་བསྒོམས་པ་ཙམ་དང་། དྲན་པ་ཙམ་གྱིས་འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་ཡོན་ཏན་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་ཐོབ་པར་འགྱུར་རོ། །ཕྱིར་མི་ལྡོག་པ་ཞེས་བྱའོ།
en: By merely recollecting this maṇḍala of liberation, the vidya holder will acquire a complete range of good qualities both worldly and supramundane.

source: །ཕྱིར་མི་ལྡོག་པའི་གནས་ལ་རབ་ཏུ་གནས་པར་འགྱུར་རོ།
en: It is called the maṇḍala of non-returning because the vidyā holder will be irreversibly established on the path to awakening.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དགོངས་པ་དང་། ལུང་སྟོན་པ་དང་། བྱིན་གྱིས་རློབ་པར་འགྱུར་ན། ལྟ་བ་དང་། ཀློག་པ་དང་།
en: All the tathāgatas will keep him in their thoughts, grant him a prophecy of his future attainment of buddhahood, and bless him.

source: ཁ་ཏོན་བྱེད་པ་དང་། འཕགས་པ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་ཕྱུག་མཐོང་སྟེ་ཕྱག་འཚལ་བ་དང་། མཆོད་པ་དང་། དྲན་པ་དང་། དུས་གསུམ་དུ་ཤིན་ཏུ་གསལ་བར་ཡིད་ལ་བྱེད་པ་དང་།
en: How much more this is true for someone who not only recollects but sees, reads, and studies this maṇḍala of liberation, who beholds, worships, and recollects Noble Avalokiteśvara, and who makes offerings, pays homage to, and lucidly reflects on him three times a day.

source: མཆོད་ཅིང་ཕྱག་བྱེད་པ་དེ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ། སེམས་ཅན་དེ་ནི་ང་དང་འདྲ་བ་ཡིན་པར་རིག་པར་བྱའོ། །འཇིག་རྟེན་དབང་ཕྱུག་གིས་བྱིན་གྱིས་བརླབས་པའི་ལུས་ཡིན་པར་རིག་པར་བྱའོ།
en: Such a being should be known to be like me, with a body blessed by the Lokeśvara.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་དང་། དབང་བསྐུར་བས་དབང་བསྐུར་བ་ཡིན་པར་རིག་པར་བྱའོ།
en: He should be known as a recipient of all the tathāgatas’ blessings and of their prophecy of his future awakening.

source: །གང་ཞིག་ལན་མང་དུ་ཤིན་ཏུ་ལྷག་པར་བྱེད་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ།
en: What about someone who does even more than this?

source: སེམས་ཅན་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་སྙིང་པོ་ཡིན་པར་རིག་པར་བྱའོ།
en: Such a being should be known as having the very nature of a tathāgata.

source: །བདག་ཀྱང་དུས་ཐམས་ཅད་དུ་རྟག་ཏུ་རྗེས་སུ་དྲན་པར་བགྱིའོ། །དུས་ཐམས་ཅད་དུ་མཐོང་བ་སྦྱིན་པར་བགྱིའོ། །བསམ་པ་དང་རེ་བ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བགྱིའོ།
en: I myself will always be close to them, appear to them continually, fulfill all their hopes, and grant all their wishes.

source: །དེའི་ཚེ་བདག་གིས་སེམས་ཅན་ཐམས་ཅད་མྱུར་བ་མྱུར་བར་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་གཞག་པར་བགྱིའོ།
en: May I include all beings in the great turning of the wheel of Dharma that will take them to the seat of awakening in the shortest possible time!

source: །བཅོམ་ལྡན་འདས་བདག་ནི་གོ་ཆ་ཆེན་པོ་བརྟན་པར་ཁས་བླངས་པ་ལ་འཚོལ་བ་ལགས་པས་སེམས་ཅན་ཐམས་ཅད་བསྒྲལ་བའི་ཕྱིར་རེ་བའི་མཆོག་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བགྱིའོ།
en: I have made a firm vow, O Blessed One, and girded myself up to deliver all beings, fulfill all their hopes, and grant them every boon.”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་ཕྱུག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The blessed Tathāgata Śākyamuni applauded Noble Avalokiteśvara, the great bodhisattva being, saying, “Good!

source: །སེམས་ཅན་དག་པའི་མཆོག་ལེགས་སོ་ལེགས་སོ།
en: Good, O supremely pure being!

source: །འདི་ནི་མཆོག་ཏུ་དཀོན་པ་སྟེ།
en: This supramundane procedure is extremely difficult to find.
